package amount2word

import (
	"fmt"
	"strings"
	"unicode"
)

var replUA = [][]string{
	// t - тысячі; m - мільйони; M - мільярди;
	{",,,,,,", "eM"},
	{",,,,,", "em"},
	{",,,,", "et"},
	// e - одиниці; d - десятки; c - сотні;
	{",,,", "e"},
	{",,", "d"},
	{",", "c"},
	{"0c0d0et", ""},
	{"0c0d0em", ""},
	{"0c0d0eM", ""},
	// --
	{"0c", ""},
	{"1c", "сто "},
	{"2c", "двісти "},
	{"3c", "триста "},
	{"4c", "чотиреста "},
	{"5c", "п'ятьсот "},
	{"6c", "шістсот "},
	{"7c", "сімьсот "},
	{"8c", "вісімсот "},
	{"9c", "дев'ятсот "},
	{"1d0e", "десять "},
	{"1d1e", "одинадцять "},
	{"1d2e", "дванадцять "},
	{"1d3e", "тринадцять "},
	{"1d4e", "чотирнадцять "},
	{"1d5e", "п'ятнадцять "},
	{"1d6e", "шістнадцять "},
	{"1d7e", "сімнадцять "},
	{"1d8e", "вісімнадцять "},
	{"1d9e", "дев'ятнадцять "},
	// --
	{"0d", ""},
	{"2d", "двадцять "},
	{"3d", "тридцять "},
	{"4d", "сорок "},
	{"5d", "п'ятдесят "},
	{"6d", "шістдесят "},
	{"7d", "сімдесят "},
	{"8d", "вісімдесят "},
	{"9d", "дев'яносто "},
	// --
	{"0e", ""},
	{"5e", "п'ять "},
	{"6e", "шість "},
	{"7e", "сім "},
	{"8e", "вісімь "},
	{"9e", "дев'ять "},
	// --
	{"1e.", "один долар"},
	{"2e.", "два долари "},
	{"3e.", "три долари "},
	{"4e.", "чотири долари "},
	{"1et", "одна тисяча "},
	{"2et", "две тисячі "},
	{"3et", "три тисячі "},
	{"4et", "чотири тисячі "},
	{"1em", "один мільйон "},
	{"2em", "два мільйона "},
	{"3em", "три мільйона "},
	{"4em", "четири мільйона "},
	{"1eM", "один мільярд "},
	{"2eM", "два мільярда "},
	{"3eM", "три мільярда "},
	{"4eM", "чотири мільярда "},
	//  блок для написания центів
	{"11k", "11 центів"},
	{"12k", "12 центів"},
	{"13k", "13 центів"},
	{"14k", "14 центів"},
	{"1k", "1 цент"},
	{"2k", "2 цента"},
	{"3k", "3 цента"},
	{"4k", "4 цента"},
	{"k", " центів"},
	// --
	{".", "доларів "},
	{"t", "тисяч "},
	{"m", "мільйонів "},
	{"M", "мільярдів "},
}

var maskUA = []string{",,,", ",,", ",", ",,,,", ",,", ",", ",,,,,", ",,", ",", ",,,,,,", ",,", ","}

// RuMoneyUA - гроші прописом ураїнською
func RuMoneyUA(number float64, upperFirstChar bool) string {

	s := fmt.Sprintf("%.2f", number)
	l := len(s)

	dest := s[l-3:l] + "k"
	s = s[:l-3]
	l = len(s)
	for i := l; i > 0; i-- {
		c := string(s[i-1])
		dest = c + maskUA[l-i] + dest
	}

	for _, r := range replUA {
		dest = strings.Replace(dest, r[0], r[1], -1)
	}
	if upperFirstChar {
		a := []rune(dest)
		a[0] = unicode.ToUpper(a[0])
		dest = string(a)
	}
	return dest
}
